ingest data from college dataset

In [7]:
dataset_id = "college_staging"

In [8]:
!bq --location=US mk --dataset {dataset_id}

Dataset 'first-planet-266901:college_staging' successfully created.

### creating tables and loading data into tables

In [22]:
!bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV {dataset_id}.Classes1 'gs://cs327e-college-data-set/Classes.csv'

Waiting on bqjob_r2b696a66d2a92902_000001700dc88aa1_1 ... (2s) Current status: DONE

In [14]:
!bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV {dataset_id}.Current_Students 'gs://cs327e-college-data-set/Current_Students.csv'

Waiting on bqjob_r8fb1010af1984c6_000001700dc4b6c5_1 ... (2s) Current status: DONE

In [15]:
!bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV {dataset_id}.New_Students 'gs://cs327e-college-data-set/New_Students.csv'

Waiting on bqjob_r5f48b3e367d72235_000001700dc4c868_1 ... (1s) Current status: DONE

### get record count for all 3 table

In [23]:
%%bigquery
select count(*) from college_staging.Classes1

   f0_
0   13

In [17]:
%%bigquery
select count(*) from college_staging.Current_Students

   f0_
0   13

In [18]:
%%bigquery
select count(*) from college_staging.New_Students

   f0_
0    7

In [2]:
%%bigquery
select * from college_staging.Classes1
limit 5

,tid,instructor,dept,cno,cname,credits
0,fares,Fares Fraij,CS,CS331E,Elements of Software Engineering,3
1,abraham,Prof. Sarah Abraham,CS,CS329E,Elements of Mobile Computing,3
2,mitra,"Mitra, Shyamal",CS,CS313E,Elements of Software Design,3
3,cannata,PHILIP CANNATA,CS,CS326E,Elements of Networking,3
4,cannata,"Cannata, Philip",CS,CS347,Data Management,3